$.fn.purify = function(flag){
	var replace = function(f, val){
		var $reg = {
			"1": /[^0-9\s]/g //숫자 *
			, "2": /[^a-z\s]/g //소문자 *
			, "3": /[^0-9a-z\s]/g //숫자, 소문자
			, "4": /[^A-Z\s]/g //대문자 *
			, "5": /[^0-9A-Z\s]/g //숫자, 대문자
			, "6": /[^a-zA-Z\s]/g //소문자, 대문자
			, "7": /[^0-9a-zA-Z\s]/g //숫자, 소문자, 대문자
			, "8": /[^ㄱ-ㅎㅏ-ㅣ가-힣\s]/g //한글 *
			, "9": /[^0-9ㄱ-ㅎㅏ-ㅣ가-힣\s]/g //숫자, 한글
			, "10": /[^a-zㄱ-ㅎㅏ-ㅣ가-힣\s]/g //소문자, 한글
			, "11": /[^0-9a-zㄱ-ㅎㅏ-ㅣ가-힣\s]/g //숫자, 소문자, 한글
			, "12": /[^A-Zㄱ-ㅎㅏ-ㅣ가-힣\s]/g //대문자, 한글
			, "13": /[^0-9A-Zㄱ-ㅎㅏ-ㅣ가-힣\s]/g //숫자, 대문자, 한글
			, "14": /[^a-zA-Zㄱ-ㅎㅏ-ㅣ가-힣\s]/g //소문자, 대문자, 한글
			, "15": /[^0-9a-zA-Zㄱ-ㅎㅏ-ㅣ가-힣\s]/g //숫자, 소문자, 대문자, 한글
			, "16": /[^\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //특수문자 *
			, "17": /[^0-9\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //숫자, 특수문자
			, "18": /[^a-z\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //소문자, 특수문자
			, "19": /[^0-9a-z\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //숫자, 소문자, 특수문자
			, "20": /[^A-Z\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //대문자, 특수문자
			, "21": /[^0-9A-Z\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //숫자, 대문자, 특수문자
			, "22": /[^a-zA-Z\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //소문자, 대문자, 특수문자
			, "23": /[^0-9a-zA-Z\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //숫자, 소문자, 대문자, 특수문자
			, "24": /[^ㄱ-ㅎㅏ-ㅣ가-힣\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //한글, 특수문자
			, "25": /[^0-9ㄱ-ㅎㅏ-ㅣ가-힣\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //숫자, 한글, 특수문자
			, "26": /[^a-zㄱ-ㅎㅏ-ㅣ가-힣\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //소문자, 한글, 특수문자
			, "27": /[^0-9a-zㄱ-ㅎㅏ-ㅣ가-힣\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //숫자, 소문자, 한글, 특수문자
			, "28": /[^A-Zㄱ-ㅎㅏ-ㅣ가-힣\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //대문자, 한글, 특수문자
			, "29": /[^0-9A-Zㄱ-ㅎㅏ-ㅣ가-힣\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //숫자, 대문자, 한글, 특수문자
			, "30": /[^a-zA-Zㄱ-ㅎㅏ-ㅣ가-힣\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //소문자, 대문자, 한글, 특수문자
			, "31": /[^0-9a-zA-Zㄱ-ㅎㅏ-ㅣ가-힣\`\~\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\{\]\}\;\:\'\"\,\<\.\>\/\?\\|\\\s]/g //숫자, 소문자, 대문자, 한글, 특수문자
		}; //end: var $reg = {

		var idx = 0;
		for(var i = 0; i < f.length; i++){
			switch(f[i]){
				case "n": //숫자
					idx += 1;
				break;
				case "e": //소문자
					idx += 2;
				break;
				case "E": //대문자
					idx += 4;
				break;
				case "k": //한글
					idx += 8;
				break;
				case "s": //키보드 특수문자 전체
					idx += 16;
				break;
			}
		} //end: for(var i = 0; i < f.length; i++){

		return idx === 0 || idx === 31 ? val : val.replace($reg[idx], "");
	} //end: var replace = function(f, val){

	return this.each(function(){
		$(this).on("keyup", function(e){
			$(this).val(replace(flag || "neEk", $(this).val()));
		});
	}); //end: return this.each(function(){
} //end: $.fn.purify = function(flag){
